of60/tutorials/channel_OldroydB/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    grad(T)         Gauss linear;
    linExtrapGrad   Gauss linear;
}

divSchemes
{
    default                  none;
    div(phi,U)               GaussDefCmpw none;  
    div(phi,theta)           GaussDefCmpw cubista;
    div(phi,tau)             GaussDefCmpw cubista;
    div(phi,T)		     GaussDefCmpw cubista;
    div(phi,C)               GaussDefCmpw cubista;
    div(tau)                 Gauss linear; 
    div(phi,lambda)          Gauss linear;
    div(phi,etaP)            Gauss linear;
    div(eta*dev2(T(gradU)))  Gauss linear;
}

laplacianSchemes
{
    default                  none;
    laplacian(eta,U)         Gauss linear corrected;
    laplacian(p|(ap-H1))     Gauss linear corrected;
    laplacian(kt,T)          Gauss linear corrected;
    laplacian(D,C)           Gauss linear corrected;
}

interpolationSchemes
{
    default           linear;
}

snGradSchemes
{
    default           corrected;
}

fluxRequired
{
    default           no;
    p;
}

// ************************************************************************* //
